

#if 0 //see frontend.h
typedef struct
{
	void* hI2c; //0
	int Data_4; //4
	uint8_t bData_8; //8
	uint8_t bData_9; //9
	uint8_t bData_10; //10
	uint8_t bData_11; //11
	uint8_t bData_12; //12
	uint8_t bData_13; //13
	uint8_t bData_14; //14
	uint8_t bData_15; //15
	uint8_t bData_16; //16
	uint8_t bData_17; //17
	//20
} Struct_2340e754;
#endif
 