
#include <stdint.h>
#include "ucos_ii.h"
#include "sys_services.h"
#include "gpio.h"
#include "i2c.h"
#include "hdmi.h"


#define HDMI_OFFSET0_SYS_CTRL1        (0x08)
#define HDMI_OFFSET0_DATA_CTRL        (0x0d)
#define HDMI_OFFSET1_PB_CTRL1         (0x3e)
#define HDMI_OFFSET1_CP_BYTE1         (0xdf)
#define HDMI_OFFSET1_HW_SPDIF_FS      (0x18)


typedef struct
{
	uint8_t bData_0; //0
	uint8_t bData_1; //1
	uint16_t wData_2; //2
	int Data_4; //4
	uint8_t edidBuffer[0x100]; //8
	int vic; //0x108
	int useDeGen; //0x10c
	int inColor; //0x110
	int outColor; //0x114
	int hdmiMode; //0x118
	int scanInfo; //0x11c
	int activeFormat; //0x120
	int fill_0x124; //0x124
	uint32_t hdcpState; //0x128
	int fill_0x12c[2]; //0x12c
	int Data_0x134; //0x134
	int fill_0x138; //0x138
	int Data_0x13c; //0x13c
	int Data_0x140; //0x140
	int channelCount; //0x144
	int channelAllocation; //0x148
	int Data_0x14c; //0x14c
	int Data_0x150; //0x150
	struct Struct_2342499c_Inner_0x20 speakerMapping[4]; //0x154
	int Data_0x164; //0x164
	int Data_0x168; //0x168
	int Data_0x16c; //0x16c
	int vsdbData6; //0x170
	int videoLatency; //0x174
	int audioLatency; //0x178
	int interlacedVideoLatency; //0x17c
	int interlacedAudioLatency; //0x180
	int audioMode; //0x184
	int audioClock; //0x188
	int audioPolarity; //0x18c
	int audioFormat; //0x190
	uint32_t chNum; //0x194
	int audioSource; //0x198
	int fs; //0x19c
	uint16_t wData_0x1a0[23]; //0x1a0
	uint16_t wData_0x1ce; //0x1ce
	uint16_t wData_0x1d0; //0x1d0
	uint16_t fill_0x1d2; //0x1d2
	//0x1d4
} hdmiHandleT;


static const uint8_t audioFormatTable[4] = //23488ae0
{
	0x45, 0x40, 0x49, 0x4d
};

static const uint8_t channelStatusTable[8] = //23488ae4
{
	0x01, 0x03, 0x00, 0x02, 0x08, 0x0a, 0x0c, 0x0e
};

static const struct
{
	int Data_0; //0
	int hActive; //4
	int hFp; //8
	int hTotal; //12
	int vActive; //16
	int vFp; //20
	int vTotal; //24
	int ratio; //0x1c = 28
	int repetition; //0x20 = 32
	int cscsel; //0x24 = 36
	//40
}
hdmiStandardVideoTiming[] = //23488aec
{
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{27000,   720, 0x00000010, 0x0000035a, 480, 0x00000009, 525, 0x00000001, 0x00000000, 0x00000000}, /*  2  720x p @ 59.94/60Hz */
	{27000,   720, 0x00000010, 0x0000035a, 480, 0x00000009, 525, 0x00000002, 0x00000000, 0x00000000}, /*  3  720x 480p @ 59.94/60Hz */
	{74250,  1280, 0x0000006e, 0x00000672, 720, 0x00000005, 750, 0x00000002, 0x00000000, 0x00000001}, /*  4 1280x 720p @ 59.94/60Hz */
	{74250,  1920, 0x00000058, 0x00000898, 540, 0x00000002, 562, 0x00000002, 0x00000000, 0x00000001}, /*  5 1920x1080i @ 59.94/60Hz */
	{27000,  1440, 0x00000026, 0x000006b4, 240, 0x00000004, 262, 0x00000001, 0x00000001, 0x00000000}, /*  6  720x 480i @ 59.94/60Hz */
	{27000,  1440, 0x00000026, 0x000006b4, 240, 0x00000004, 262, 0x00000002, 0x00000001, 0x00000000}, /*  7  720x 480i @ 59.94/60Hz */
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
	{27000,   720, 0x0000000c, 0x00000360, 576, 0x00000005, 625, 0x00000001, 0x00000000, 0x00000000}, /* 17  720x 576p @ 50Hz */
	{27000,   720, 0x0000000c, 0x00000360, 576, 0x00000005, 625, 0x00000002, 0x00000000, 0x00000000}, /* 18  720x 576p @ 50Hz */
	{74250,  1280, 0x000001b8, 0x000007bc, 720, 0x00000005, 750, 0x00000002, 0x00000000, 0x00000001}, /* 19 1280x 720p @ 50Hz */
	{74250,  1920, 0x00000210, 0x00000a50, 540, 0x00000002, 562, 0x00000002, 0x00000000, 0x00000001}, /* 20 1920x1080i @ 50Hz */
	{27000,  1440, 0x00000018, 0x000006c0, 288, 0x00000002, 312, 0x00000001, 0x00000001, 0x00000000}, /* 21  720x 576i @ 50Hz */
	{27000,  1440, 0x00000018, 0x000006c0, 288, 0x00000002, 312, 0x00000002, 0x00000001, 0x00000000}, /* 22  720x 576i @ 50Hz */
	{0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000, 0x00000000},
};

static const uint32_t N_value32[] = //23488eac
{
	4096, 4576, 11648, 11648
};
static const uint32_t N_value44[] = //23488ebc
{
	6272, 7007, 17836, 8918
};
static const uint32_t N_value48[] = //23488ecc
{
	6144, 6864, 11648, 5824
};


void* Data_234923ec = 0; //234923ec //i2c
void* hdmi_sema = 0; //234923f0 +4 //sema
uint8_t arData_234923f4[8] = {0}; //234923f4 +8

hdmiHandleT hdmiHandleArray[2]; //235f08c8 -> 235F0C70

struct
{
	int Data_0; //0
	int Data_4; //4
	int Data_8; //8
	int Data_0xc; //0xc
	int Data_0x10; //0x10
	int fill_0x14[16]; //0x14
	int Data_0x54; //0x54
	int Data_0x58; //0x58

} Data_235f0c70; //235f0c70


int hdmiI2cWriteByte(int a, uint8_t, uint8_t);
uint8_t hdmiI2cReadByte(int a, int b);
void hdmiAvMute(int);
void hdmiI2cAndWrite(uint8_t, uint8_t, uint8_t);
void hdmiI2cOrWrite(uint8_t, uint8_t, uint8_t);
void hdmiClearInfoFrame(uint8_t infoframeType, int select);
void hdmiSendInfoFrame(uint8_t infoframeType, uint8_t select);
void hdmiSetVideoMode(hdmiHandleT* );



/* 23422cac - complete */
void hdmiInitializeVideoRegister()
{
#if 0
	console_send_string("hdmiInitializeVideoRegister (todo.c): TODO\r\n");
#endif

	hdmiI2cWriteByte(0x72, 0x0d, 0x04);
	hdmiI2cWriteByte(0x72, 0x0f, 0x00);
	hdmiI2cWriteByte(0x72, 0x27, 0x00);
	hdmiI2cWriteByte(0x72, 0x32, 0x00);
	hdmiI2cWriteByte(0x72, 0x33, 0x00);
	hdmiI2cWriteByte(0x72, 0x34, 0x00);
	hdmiI2cWriteByte(0x72, 0x36, 0x00);
	hdmiI2cWriteByte(0x72, 0x37, 0x00);
	hdmiI2cWriteByte(0x72, 0x38, 0x00);
	hdmiI2cWriteByte(0x72, 0x39, 0x00);
	hdmiI2cWriteByte(0x72, 0x3e, 0x04);
