
#include <stdint.h>
#include "ucos_ii.h"
#include "sys_services.h"
#include "gpio.h"
#include "bm.h"
#include "tsd.h"
//#include "rl_net.h"

struct unaligned_int
{
	uint32_t i;
} __attribute__((__packed__, __may_alias__));

//bm.c
extern int Data_234ac874; //234ac874
extern int Data_234ac878; //234ac878
extern int Data_234ac87c; //234ac87c / 23492354
extern int Data_234ac880; //234ac880 / 23492358
extern int Data_234ac884; //234ac884
extern int Data_234ac888; //234ac888
extern int Data_234ac88c; //234ac88c
extern int Data_234ac890; //234AC890

int sub_2342dea8(int, Struct_2342c4f8_Inner8*);
void sub_2342dd4c(int, int);
void sub_2342dd64(int, int);
void sub_2342ddcc(int);
uint32_t sub_2342292c(int);
uint32_t sub_23422944(int);

//234923a4 / 234ac8cc
int Data_234ac8cc = 0; //234ac8cc
int Data_234ac8d0 = 0; //234ac8d0 +4
void* tsd_sema/*sema*/ = 0; //234923AC / 234ac8d4 +8
int Data_234ac8d8 = 0; //234923B0 / 234ac8d8 +0xc
int Data_234ac8dc = 0; //234923B4 / 234AC8DC +0x10

//bm.c
extern int Data_236e0b14[]; //236e0b14 / 235b1cec
extern int Data_236e0b34[]; //236e0b34 / 235b1d0c

uint32_t FREG_TSD0_PidValueMirror[13]; //236e3484
uint32_t FREG_TSD0_PidConfig_1Mirror[32]; //236e34b8
uint32_t FREG_TSD0_PidConfig_2Mirror[32]; //236e3538
uint32_t Data_236e35b8[32]; //236e35b8
uint32_t Data_236e3638[32]; //236e3638
uint32_t Data_236e36b8[32]; //236e36b8
uint32_t Data_236e3738[32]; //236e3738
uint32_t FREG_TSD1_PidValueMirror[13]; //236e37b8
uint32_t FREG_TSD1_PidConfig_1Mirror[32]; //236e37ec
uint32_t FREG_TSD1_PidConfig_2Mirror[32]; //236e386c
uint32_t Data_236e38ec[32]; //236e38ec
uint32_t Data_236e396c[32]; //236e396c
uint32_t Data_236e39ec[32]; //236e39ec
uint32_t Data_236e3a6c[32]; //236e3a6c
uint32_t FREG_TSD2_PidValueMirror[13]; //236e3aec
uint32_t FREG_TSD2_PidConfig_1Mirror[32]; //236e3b20
uint32_t FREG_TSD2_PidConfig_2Mirror[32]; //236e3ba0
uint32_t Data_236e3c20[32]; //236e3c20
uint32_t Data_236e3ca0[32]; //236e3ca0
uint32_t Data_236e3d20[32]; //236e3d20
uint32_t Data_236e3da0[32]; //236e3da0
uint32_t FREG_TSD3_PidValueMirror[13]; //236e3e20
uint32_t FREG_TSD3_PidConfig_1Mirror[32]; //236e3e54
uint32_t FREG_TSD3_PidConfig_2Mirror[32]; //236e3ed4
uint32_t Data_236e3f54[32]; //236e3f54
uint32_t Data_236e3fd4[32]; //236e3fd4
uint32_t Data_236e4054[32]; //236e4054
uint32_t Data_236e40d4[32]; //236e40d4

struct Struct_236e4154
{
	uint8_t bData_0; //0
	int Data_4; //4 //TODO: Change to bitfield!!!
	//8
} Data_236e4154[4][128]; //236e4154 -> 236E5154


TSD_Handle Data_236e5154[40]; //236e5154 -> 236E5834

Struct_236e5834 Data_236e5834[40]; //236e5834 +39A80 = 2371F2B4 / 235b6a0c

struct
{
	int fill_0[242]; //0
	//0x3c8
} Data_2371f2b4; //2371f2b4 -> 2371F67C


TSD_InitParams Data_2371f67c; //2371f67c -> 2371F6C4

struct
{
	Struct_20611068* Data_0; //0
	Struct_20611068* Data_4; //4
	Struct_20611068* Data_8; //8
	Struct_20611068* Data_0xc; //12
	Struct_20611068* Data_0x10; //16
	Struct_20611068* Data_0x14; //20
	Struct_20611068* Data_0x18; //24
	Struct_20611068* Data_0x1c; //28
	Struct_20611068* Data_0x20; //32
	Struct_20611068* Data_0x24; //36
	Struct_20611068* Data_0x28; //40

} Data_2371f6c4;


Struct_235f048c Data_235f048c[22]; //235f048c



/* 2342a20c - todo */
void tsd_SetCrc(int a, int b, int c)
{
	volatile uint32_t* r3 = (void*) (0xc8500000 + (b * 8));

	if (a == 0)
	{
		r3[1] = c; //FREG_TSD0_CRC
	}
	else if (a == 1)
	{
		r3[65] = c; //FREG_TSD1_CRC
	}
	else
	{
		r3 = (void*) (0xc8d00000 + (b * 8));
		if (a == 2)
		{
			r3[1] = c; //FREG_TSD2_CRC
		}
		else
		{
			r3[65] = c; //FREG_TSD3_CRC
		}
	}
}


/* 2342a244 - todo */
void sub_2342a244(int a, int b, int c)
{
	volatile uint32_t* r3 = (void*) (0xc8100000 + (b * 16));

	if (a == 0)
	{
		Data_236e3738[b] = c;
		r3[80] = c; //?
	}
	else if (a == 1)
	{
		Data_236e3a6c[b] = c;
		r3[208] = c; //
	}
	else
	{
		r3 = (void*) (0xc8900000 + (b * 16));
		if (a == 2)
		{
			Data_236e3da0[b] = c;
			r3[80] = c; //
		}
		else
		{
			Data_236e40d4[b] = c;
			r3[208] = c; //
		}
	}
}


/* 2342a294 - todo */
void sub_2342a294(int a, int b, int c)
{
